// 1. Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

//let number = prompt("Enter the number");
//number = Number(number);

//if (number === 10) {
//    alert("Right")
//} else {
//    alert("Wrong")
//}


2.
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);


3.
// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

//let num = prompt("Choose your number betwen 1 and 4");

//let result;
//switch (num) {
//    case "1":
//        result = "Winter";
//        break;
//    case "2":
//        result = "Spring";
//        break;
//    case "3":
//        result = "Summer";
//        break;
//    case "4":
//        result = "Autumn";
//        break;
//    default:
//        result = "Вибачте, але ви маєте ввести значення від 1 до 4 включно";
//}

//console.log(result);

4.
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


5.
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// let login = prompt("Enter your login");

// if (login === "Admin") {
//    let password = prompt("Enter your password");

//    if (password === "I am a boss") {
//        alert("Hello!");
//    } else {
//        alert("Wrong password");
//    }
//} else if(login === "" || login === null) {
//    alert("Cancelled");
//} else {
//    alert("I don't know you");
//}

6.
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.


let number = 0;
    
while (number <= 20) {
    console.log(number)
    number += 1;
}



